Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_ЭтапСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СубконтоКт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетБанк</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаОплаты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоходыЕНВД_УСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Патент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Графа5_УСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Графа6_УСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СубконтоКт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СубконтоКт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеКт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КурсНаДатуПриобретенияРеализацииВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьРазницуВКурсеВСоставеОперационныхРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Содержание_УСН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Графа4_УСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Графа7_УСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДС_УСН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НаличиеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НаличиеФайлов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъектСФайлами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЧекиНПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЧекиНПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПоступлениеНаРасчетныйСчет/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура АЛФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)   
	
	//Переопределение запроса
	ТекстЗапроса = 	"ВЫБРАТЬ
	               	|	ДокументПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ПометкаУдаления КАК ПометкаУдаления,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Номер КАК Номер,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Дата КАК Дата,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Проведен КАК Проведен,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Организация КАК Организация,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ВидОперации КАК ВидОперации,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетОрганизации КАК СчетОрганизации,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетБанк КАК СчетБанк,
	               	|	ДокументПоступлениеНаРасчетныйСчет.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Контрагент КАК Контрагент,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетКонтрагента КАК СчетКонтрагента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Патент КАК Патент,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СуммаДокумента КАК СуммаДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СубконтоКт1 КАК СубконтоКт1,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СубконтоКт2 КАК СубконтоКт2,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СубконтоКт3 КАК СубконтоКт3,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ПодразделениеКт КАК ПодразделениеКт,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	               	|	ДокументПоступлениеНаРасчетныйСчет.СуммаУслуг КАК СуммаУслуг,
	               	|	ДокументПоступлениеНаРасчетныйСчет.КурсНаДатуПриобретенияРеализацииВалюты КАК КурсНаДатуПриобретенияРеализацииВалюты,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ОтражатьРазницуВКурсеВСоставеОперационныхРасходов КАК ОтражатьРазницуВКурсеВСоставеОперационныхРасходов,
	               	|	ДокументПоступлениеНаРасчетныйСчет.НазначениеПлатежа КАК НазначениеПлатежа,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Ответственный КАК Ответственный,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Комментарий КАК Комментарий,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ВалютаДокумента КАК ВалютаДокумента,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДокументОснование КАК ДокументОснование,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Содержание_УСН КАК Содержание_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа4_УСН КАК Графа4_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа5_УСН КАК Графа5_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа6_УСН КАК Графа6_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.Графа7_УСН КАК Графа7_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ДоходыЕНВД_УСН КАК ДоходыЕНВД_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.НДС_УСН КАК НДС_УСН,
	               	|	ДокументПоступлениеНаРасчетныйСчет.РучнаяКорректировка КАК РучнаяКорректировка,
	               	|	ВЫБОР
	               	|		КОГДА ДокументПоступлениеНаРасчетныйСчет.РучнаяКорректировка = ИСТИНА
	               	|			ТОГДА ВЫБОР
	               	|					КОГДА ДокументПоступлениеНаРасчетныйСчет.ПометкаУдаления = ИСТИНА
	               	|						ТОГДА 10
	               	|					КОГДА ДокументПоступлениеНаРасчетныйСчет.Проведен = ЛОЖЬ
	               	|						ТОГДА 9
	               	|					ИНАЧЕ 8
	               	|				КОНЕЦ
	               	|		ИНАЧЕ ВЫБОР
	               	|				КОГДА ДокументПоступлениеНаРасчетныйСчет.ПометкаУдаления = ИСТИНА
	               	|					ТОГДА 2
	               	|				КОГДА ДокументПоступлениеНаРасчетныйСчет.Проведен = ИСТИНА
	               	|					ТОГДА 1
	               	|				ИНАЧЕ 0
	               	|			КОНЕЦ
	               	|	КОНЕЦ КАК СостояниеДокумента,
	               	|	ВЫБОР
	               	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	               	|			ТОГДА 1
	               	|		КОГДА НаличиеФайлов.ЕстьФайлы
	               	|			ТОГДА 0
	               	|		ИНАЧЕ 1
	               	|	КОНЕЦ КАК ЕстьФайлы,
	               	|	ЧекиНПД.НомерЧека КАК НомерЧека,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ИИТ_ОбъектСтроительства КАК ИИТ_ОбъектСтроительства,
	               	|	ДокументПоступлениеНаРасчетныйСчет.ИИТ_ЭтапСтроительства КАК ИИТ_ЭтапСтроительства
	               	|ИЗ
	               	|	Документ.ПоступлениеНаРасчетныйСчет КАК ДокументПоступлениеНаРасчетныйСчет
	               	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	               	|		ПО ДокументПоступлениеНаРасчетныйСчет.Ссылка = НаличиеФайлов.ОбъектСФайлами}
	               	|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧекиНПД КАК ЧекиНПД
	               	|		ПО (ЧекиНПД.ДокументОснование = ДокументПоступлениеНаРасчетныйСчет.Ссылка)
	               	|			И (ЧекиНПД.Организация = ДокументПоступлениеНаРасчетныйСчет.Организация)}";
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Документ.ПоступлениеНаРасчетныйСчет";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,
		СвойстваСписка);   
		
	//Колонки в ТЧ
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ОбъектСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Объект строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ОбъектСтроительства";
	
	ЭлементСпискаФормы = Элементы.Добавить("ИИТ_ЭтапСтроительства", Тип("ПолеФормы"), Элементы.Список);
	ЭлементСпискаФормы.Заголовок = "Этап строительства"; 
	ЭлементСпискаФормы.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементСпискаФормы.ПутьКДанным = "Список.ИИТ_ЭтапСтроительства";

КонецПроцедуры
